{
    "definition": {
        "$schema": "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#",
        "actions": {
            "Run_query_and_visualize_results": {
                "inputs": {
                    "body": "SecurityIncident\n| where TimeGenerated > ago(1d) \n| where Status == \"New\"\n| project TimeGenerated, Title, Description, Severity, IncidentUrl",
                    "host": {
                        "connection": {
                            "name": "@parameters('$connections')['azuremonitorlogs_1']['connectionId']"
                        }
                    },
                    "method": "post",
                    "path": "/visualizeQuery",
                    "queries": {
                        "resourcegroups": "<resourcegroup>",
                        "resourcename": "<resourcename>",
                        "resourcetype": "Log Analytics Workspace",
                        "subscriptions": "<subscriptions>",
                        "timerange": "Set in query",
                        "visType": "Html Table"
                    }
                },
                "runAfter": {},
                "type": "ApiConnection"
            },
            "Send_an_email_(V2)": {
                "inputs": {
                    "body": {
                        "Body": "<p><span style=\"font-size: 18px\"><strong>Here is the list of Incidents that were created overnight:</strong></span><br>\n<br>\n@{base64ToString(body('Run_query_and_visualize_results')?['attachmentContent'])}</p>",
                        "Subject": "Azure Sentinel Incidents Created Overnight",
                        "To": "email@address.com"
                    },
                    "host": {
                        "connection": {
                            "name": "@parameters('$connections')['office365_1']['connectionId']"
                        }
                    },
                    "method": "post",
                    "path": "/v2/Mail"
                },
                "runAfter": {
                    "Run_query_and_visualize_results": [
                        "Succeeded"
                    ]
                },
                "type": "ApiConnection"
            }
        },
        "contentVersion": "1.0.0.0",
        "outputs": {},
        "parameters": {
            "$connections": {
                "defaultValue": {},
                "type": "Object"
            }
        },
        "triggers": {
            "Recurrence": {
                "recurrence": {
                    "frequency": "Day",
                    "interval": 1,
                    "schedule": {
                        "hours": [
                            "7"
                        ],
                        "minutes": [
                            0
                        ]
                    }
                },
                "type": "Recurrence"
            }
        }
    },
    "parameters": {
        "PlaybookName": {
            "defaultValue": "SendOvernightIncidentEmail",
            "type": "string"
        },
        "UserName": {
            "defaultValue": "<username>@<domain>",
            "type": "string"
        }
    }
}